{
  "selectedTemplate": 2,
  "headings": {
    "projects": "",
    "awards": "Certificates"
  },
  "basics": {
    "email": "claytonohmes@gmail.com",
    "phone": "5734271033",
    "location": {
      "address": "Atlanta, GA"
    },
    "name": "Clayton Ohmes",
    "website": "https://github.com/claytonohmes"
  },
  "education": [
    {
      "institution": "Missouri S&T",
      "location": "Rolla, MO",
      "area": "Electrical Engineering | Minor: Automation Engineering",
      "startDate": "Aug 2016",
      "endDate": "Dec 2020",
      "gpa": "",
      "studyType": "BS:"
    }
  ],
  "work": [
    {
      "website": "",
      "highlights": [
        "Led UI/UX design for a modular, web-based MES system, ensuring seamless Go-Live deployment across 19 manufacturing sites.",
        "Owned all UI, UX, and utilization portions, collaborating with teams for smooth system integration and data flow.",
        "Developed JavaScript functions for dynamic web page logic and API-based data exchange (JSON/XML) with SQL Server and custom APIs.",
        "Automated the utilization import process with Python scripts, saving 760 man hours in manual data entry and reducing errors.",
        "Contributed to estimated $10 million per site per year in savings by reducing inventory errors and overproduction.",
        "Implemented an inventory adjustment feature saving 10 man hours per week per site, totaling 520 man hours annually, with savings of $67,600 per site.",
        "Wrote and optimized all Python scripts independently, ensuring high performance and data accuracy."
      ],
      "location": "Atlanta, GA",
      "company": "The Clorox Company",
      "startDate": "Oct 2024",
      "endDate": "Present",
      "position": "Senior MES Technical Lead"
    },
    {
      "endDate": "Oct 2024",
      "highlights": [
        "Contributed to OT cybersecurity recovery, restoring application servers and connectivity across sites. As a result, consulted on the design and implementation of a new network infrastructure, including firewalls and remote access, in response to the incident.",
        "Automated repetitive processes and resolved networking issues using Python scripts.",
        "Created SCADA dashboards and developed PLC code to support production analytics and desired control system functionality."
      ],
      "position": "Senior Controls & OT Network Engineer",
      "startDate": "Mar 2023"
    },
    {
      "highlights": [
        "Lead Electrical and Controls Engineer for various manufacturing projects around the business. Most notable responsibility is a $150M+ greenfield facility utilizing a new process to manufacture cat litter.",
        "Built the framework for a comprehensive data historian and analytics platform, which was widely adopted across multiple sites. Documented this approach with a standard which included asset templates and VB scripts for KPI calculations."
      ],
      "position": "Electrical, Instrumentation, and Controls Engineer",
      "startDate": "July 2022",
      "endDate": "Mar 2023"
    },
    {
      "highlights": [
        "Led the controls design and commissioning of a $46 million wipes production line during the peak of the pandemic, ensuring project completion under challenging conditions.",
        "Managed the programming and change management of the plant control system and a team of 16 maintenance technicians"
      ],
      "startDate": "Jan 2021",
      "endDate": "July 2022",
      "position": "Control System Specialist"
    }
  ],
  "skills": [
    {
      "level": "",
      "keywords": [
        "Python",
        "Javascript",
        "Powershell",
        "HTML",
        "SQL"
      ],
      "name": "Programming"
    },
    {
      "keywords": [
        "HTTP",
        "XML",
        "JSON"
      ],
      "name": "APIs and Configurations"
    },
    {
      "keywords": [
        "VLANs",
        "Azure",
        "NAT",
        "VPNs",
        "Firewalls",
        "Switches"
      ],
      "name": "Network Architecture"
    },
    {
      "keywords": [
        "Azure Devops",
        "GitFlow",
        "Windows Server",
        "Service Accounts",
        "linux",
        "Docker",
        "Pipelines",
        "Scripting"
      ],
      "name": "DevOps"
    }
  ],
  "projects": [
    {
      "description": "Deployed UDTs (User Defined Types) in PLCs across 7 sites to standardize data collection for a root cause analysis engine. Wrote XML configurations using Python to integrate the data into the analysis system.",
      "keywords": [
        "XML",
        "Python",
        "PLCs",
        "SCADA"
      ],
      "name": "Machine Utilization Tracking System"
    },
    {
      "keywords": [
        "Python",
        "SCADA",
        "NSSM"
      ],
      "name": "Automated Batch Reciept Storage",
      "description": "Added functionality to the SCADA to automate printing batch receipts to PDF under a standard naming convention. Developed a Windows service with NSSM and Python to automate copying them to the plant's file server, ensuring automatic operation on system reboot.",
      "url": "https://github.com/claytonohmes/Copy-Directory"
    }
  ],
  "awards": [
    {
      "title": "Automate the Boring Stuff with Python | Python Zero to Hero | API and Web Service ",
      "awarder": "Udemy",
      "date": "2023-2024"
    }
  ],
  "sections": [
    "templates",
    "profile",
    "education",
    "work",
    "skills",
    "projects",
    "awards"
  ]
}